Repository: Navya2k6/pashumitra_app
Catalog: lib/l10n/app_*.arb
Languages: te

# appTitle
source: Pashumitra
te: పశుమిత్ర

# welcomeMessage
source: Welcome to Pashumitra
te: పశుమిత్రకు స్వాగతం

# appSlogan
source: Your personal AI assistant for modern farming.
te: ఆధునిక వ్యవసాయం కోసం మీ వ్యక్తిగత AI సహాయకుడు.

# getStartedButton
source: Let's Get Started
te: ప్రారంభిద్దాం

# homePageTitle
source: Home Page
te: హోమ్ పేజీ

# herdPageTitle
source: My Herd Page
te: నా పశువుల మంద

# aiChatPageTitle
source: AI Chat Page
te: AI చాట్ పేజీ

# profilePageTitle
source: Profile Page
te: ప్రొఫైల్ పేజీ

# weatherBoxTitle
source: Today's Weather
te: నేటి వాతావరణం

source: Today
te: నేడు

# manageFarmTitle
source: Animal Recognition
te: మీ వ్యవసాయ క్షేత్రాన్ని నిర్వహించండి

source: Take a picture
te: చిత్రం తీయండి

source: Breed Identification
te: జాతి గుర్తింపు

source: Get Advice
te: సలహా పొందండి

# takePictureButton
source: Take a Picture of the Animal
te: పశువు యొక్క చిత్రం తీయండి

# navHome
source: Home
te: హోమ్

# navHerd
source: Herd
te: పాడి

# navAiChat
source: AI Chat
te: AI చాట్

# navProfile
source: Profile
te: ప్రొఫైల్

# emergencyMessage
source: Animal Emergency? Call Our helpline for immediate help. If an animal is injured, Stay eith it until help arrives. Emergency Number :ðŸ“ž 9820122602
te: జంతువుకు తక్షణ ప్రమాదం ఉన్న పరిస్థితిని మీరు నివేదించవలసి వస్తే, దయచేసి మా అత్యవసర నంబర్‌కు కాల్ చేయండి: (0) 98201 22602. జంతువు గాయపడితే, సహాయం అందే వరకు దయచేసి జంతువుతోనే ఉండండి.

# litresPerDay
source: Litres/day
te: లీటర్లు/రోజు

# animalNameLakshmi
source: Lakshmi
te: లక్ష్మి

# animalBreedHolsteinFriesian
source: Holstein Friesian
te: హోల్‌స్టెయిన్ ఫ్రీసియన్

# animalNameGanga
source: Ganga
te: గంగ

# animalBreedJersey
source: Jersey
te: జెర్సీ

# animalNameYamuna
source: Yamuna
te: యమున

# animalBreedMurrahBuffalo
source: Murrah Buffalo
te: ముర్రా బర్రె

# profileView
source: View Profile
te: ప్రొఫైల్‌ను వీక్షించండి

source: Preferences
te: ప్రాధాన్యతలు

source: Change Language
te: భాషను మార్చండి

source: Dark Mode
te: డార్క్ మోడ్

source: Support
te: మద్దతు

source: Query Support
te: ప్రశ్న మద్దతు

source: About Us
te: మా గురించి

source: Logout
te: లాగ్ అవుట్

# loggedOutTitle
source: Your Account
te: మీ ఖాతా

# loggedOutSubtitle
source: Log in to access your farm details, herd management, and personalized advice.
te: మీ వ్యవసాయ వివరాలు, పశువుల మందల నిర్వహణ, మరియు వ్యక్తిగతీకరించిన సలహాలను యాక్సెస్ చేయడానికి లాగిన్ చేయండి.

source: Login
te: లాగిన్

# myProfileTitle
source: My Profile
te: నా ప్రొఫైల్

# editProfile
source: Edit
te: సవరించు

# saveProfile
source: Save
te: సేవ్ చేయి

# profileNameLabel
source: Name
te: పేరు

# profileAgeLabel
source: Age
te: వయస్సు

# profilePhoneLabel
source: Phone Number
te: ఫోన్ నంబర్

# chatWelcomeMessage
source: Hello! I am Pashumitra, your AI assistant. How can I help you with your livestock today?
te: నమస్కారం! నేను పశుమిత్ర, మీ AI సహాయకుడిని. ఈ రోజు మీ పశువుల విషయంలో నేను మీకు ఎలా సహాయపడగలను?

# chatError
source: Sorry, an error occurred. Please try again.
te: క్షమించండి, ఒక లోపం సంభవించింది. దయచేసి మళ్లీ ప్రయత్నించండి.

# notificationsTitle
source: Notifications
te: నోటిఫికేషన్‌లు

# vaccinationReminderTitle
source: Vaccination Reminder
te: టీకా రిమైండర్

# vaccinationReminderMsg
source: Your cow, Lakshmi, is due for her annual vaccination on October 5th.
te: మీ ఆవు, లక్ష్మి, వార్షిక టీకా అక్టోబర్ 5న వేయవలసి ఉంది.

# healthCheckupTitle
source: Health Checkup
te: ఆరోగ్య తనిఖీ

# healthCheckupMsg
source: Schedule a health checkup for your goat. It has been 6 months since the last one.
te: మీ మేక కోసం ఆరోగ్య తనిఖీని షెడ్యూల్ చేయండి। చివరి తనిఖీ జరిగి 6 నెలలు అయింది.

# newArticleTitle
source: New Article Available
te: కొత్త వ్యాసం అందుబాటులో ఉంది

# newArticleMsg
source: Read our latest article: "Tips for managing livestock during the winter season."
te: మా తాజా వ్యాసం చదవండి: "శీతాకాలంలో పశువుల నిర్వహణకు చిట్కాలు."
